In [3]:
import pandas as pd
import numpy as np

In [9]:
s = pd.Series([9904312, 3448737, 2980765, 3465312],
              index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2980765
대구    3465312
dtype: int64

In [11]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [13]:
s.values

array([9904312, 3448737, 2980765, 3465312], dtype=int64)

In [15]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [17]:
s = pd.Series([9904312, 3448737, 2980765, 3465312],
              index = ["서울", "부산", "인천", "대구"])
s.name = "인구"
s.index.name ="도시"
s

도시
서울    9904312
부산    3448737
인천    2980765
대구    3465312
Name: 인구, dtype: int64

In [21]:
s[2], s["대구"]

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_16604\4213226053.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[2], s["대구"]

(2980765, 3465312)

In [23]:
s[2]/1000

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_16604\2849746963.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[2]/1000

2980.765

In [25]:
s[[0,3,1]]

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_16604\181403017.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[0,3,1]]

도시
서울    9904312
대구    3465312
부산    3448737
Name: 인구, dtype: int64

In [27]:
s

도시
서울    9904312
부산    3448737
인천    2980765
대구    3465312
Name: 인구, dtype: int64

In [29]:
s[(250e4 < s) & (s < 500e4)]

도시
부산    3448737
인천    2980765
대구    3465312
Name: 인구, dtype: int64

In [39]:
for k, v in s.items():
    print("%s = %d" %(k, v))

서울 = 9904312
부산 = 3448737
인천 = 2980765
대구 = 3465312

In [43]:
s[2]

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_16604\2635755408.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[2]

2980765

In [37]:
s2 = pd.Series({"서울": 9904312, "부산":3448737, "인천":2980765, "대구":3465312},
              index = ["서울", "부산", "인천", "대구"])

s2

서울    9904312
부산    3448737
인천    2980765
대구    3465312
dtype: int64

In [41]:
s2[2]

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_16604\3318850340.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[2]

2980765

## 연습 문제
### 1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
### 2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다

In [57]:
s = pd.Series({"서울": 9904312, "부산":3448737, "인천":2980765, "대구":3465312},
              index = ["서울", "부산", "인천", "대구"])
s1 = pd.Series({"서울": 9904312, "부산":3448737, "용인":7680654, "대구":3465312},
              index = ["서울", "부산", "용인", "대구"])

In [59]:
s[:1]

서울    9904312
dtype: int64

In [52]:
s1

서울    9904312
부산    3448737
용인    7680654
대구    3465312
dtype: int64

In [58]:
r = s - s1
r1 = s + s1
r2 = s * s1
r3 = s / s1

print(r)
print(r1)
print(r2)
print(r3)

대구    0.0
부산    0.0
서울    0.0
용인    NaN
인천    NaN
dtype: float64
대구     6930624.0
부산     6897474.0
서울    19808624.0
용인           NaN
인천           NaN
dtype: float64
대구    1.200839e+13
부산    1.189379e+13
서울    9.809540e+13
용인             NaN
인천             NaN
dtype: float64
대구    1.0
부산    1.0
서울    1.0
용인    NaN
인천    NaN
dtype: float64

In [60]:
print(r.dropna()) ## NaN 값을 제외하고 출력
print(r1.dropna())
print(r2.dropna())
print(r3.dropna())

대구    0.0
부산    0.0
서울    0.0
dtype: float64
대구     6930624.0
부산     6897474.0
서울    19808624.0
dtype: float64
대구    1.200839e+13
부산    1.189379e+13
서울    9.809540e+13
dtype: float64
대구    1.0
부산    1.0
서울    1.0
dtype: float64

In [62]:
values = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
index = ["one", "two", "three"]
col = ["A", "B", "C"]

df = pd.DataFrame(values, index = index, columns = col)
print("데이터 프레임 출력")
print("*" * 18)
print(df)

데이터 프레임 출력
******************
       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [64]:
df1 = pd.DataFrame(values, columns = col)
print(df1)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [66]:
values = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
index = [1, 2, 3]
col = ["A", "B", "C"]

df = pd.DataFrame(values, index = index, columns = col)
print("데이터 프레임 출력")
print("*" * 18)
print(df)

데이터 프레임 출력
******************
   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [68]:
print(df.index)

Index([1, 2, 3], dtype='int64')

In [74]:
data = [["1000", "Steve", 90.72],
        ["1001", "James", 78.09],
        ["1002", "Doyeon", 98.43],
        ["1003", "Jane", 64.19],
        ["1004", "Pilwoong", 81.30],
        ["1005", "Tony", 99.14]
       ]
columns = ["Num", "Name", "Grade"]
index = [1, 2, 3, 4, 5, 6]

df = pd.DataFrame(data, index = index, columns = columns)
print(df)

    Num      Name  Grade
1  1000     Steve  90.72
2  1001     James  78.09
3  1002    Doyeon  98.43
4  1003      Jane  64.19
5  1004  Pilwoong  81.30
6  1005      Tony  99.14

In [5]:
# 딕셔너리로 생성하기
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [94]:
df.loc["서울"]

지역                   수도권
2015             9904312
2010             9631482
2005             9762546
2000             9853972
2010-2015 증가율     0.0283
Name: 서울, dtype: object

In [102]:
df.T ## 전치 가능

                    서울       부산       인천       대구
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [7]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] *100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [17]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(3)
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83         -1.343
부산  경상권  3448737  3393191  3512547  3655437           1.63         -3.398
인천  수도권  2890451  2632035  2517680  2466338           9.82          4.542
대구  경상권  2466052  2431774  2456016  2473990           1.41         -0.987

In [19]:
del df["2010-2015 증가율"]
df

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972         -1.343
부산  경상권  3448737  3393191  3512547  3655437         -3.398
인천  수도권  2890451  2632035  2517680  2466338          4.542
대구  경상권  2466052  2431774  2456016  2473990         -0.987

In [21]:
df[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [23]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [25]:
type(df["2010"])

pandas.core.series.Series

In [53]:
df2 = pd.DataFrame(np.append(np.arange(13), [np.nan]*2).reshape(3, 5))
df2

      0     1     2    3    4
0   0.0   1.0   2.0  3.0  4.0
1   5.0   6.0   7.0  8.0  9.0
2  10.0  11.0  12.0  NaN  NaN

In [31]:
df2[3][2]

11

In [55]:
df[:1]

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972         -1.343

In [61]:
df["서울":"부산"]

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972         -1.343
부산  경상권  3448737  3393191  3512547  3655437         -3.398

In [63]:
df["2010"]["대구"]

2431774

### 2 연습문제

In [66]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [68]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [76]:
type(df["수학"])

pandas.core.series.Series

In [80]:
type(df[["국어","영어"]])

pandas.core.frame.DataFrame

In [130]:
# df["과목 평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / len(columns)).round(2)
# axis = 0 -> 행 axis = 1 -> 열
df["과목 평균 점수"] = round(df.mean(axis = 1), 2)
df

    국어  영어  수학  과목 평균 점수
춘향  80  90  90     86.67
몽룡  90  70  60     73.33
향단  70  60  80     70.00
방자  30  80  70     60.00

In [92]:
df["영어"]["방자"] = 80
df["과목 평균 점수"] = ((df["국어"] + df["영어"] + df["수학"]) / len(columns)).round(2)
df

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_5636\178018184.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["영어"]["방자"] = 80
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_5636\178018184.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학  과목 평균 점수
춘향  80  90  90     86.67
몽룡  90  70  60     73.33
향단  70  60  80     70.00
방자  30  80  70     60.00

In [132]:
df.loc["방자", "영어"] = 50
df

    국어  영어  수학  과목 평균 점수
춘향  80  90  90     86.67
몽룡  90  70  60     73.33
향단  70  60  80     70.00
방자  30  50  70     60.00

In [96]:
df[0:1]

    국어  영어  수학  과목 평균 점수
춘향  80  90  90     86.67

In [134]:
(df.loc["향단"])

국어          70.0
영어          60.0
수학          80.0
과목 평균 점수    70.0
Name: 향단, dtype: float64

In [138]:
pd.Series(list(df[2:3].values), index = ["향단"])

향단    [70.0, 60.0, 80.0, 70.0]
dtype: object

In [156]:
print(df.head(4))

    국어  영어  수학  과목 평균 점수
춘향  80  90  90     86.67
몽룡  90  70  60     73.33
향단  70  60  80     70.00
방자  30  50  70     60.00

In [152]:
print(df.tail(3))

    국어  영어  수학  과목 평균 점수
몽룡  90  70  60     73.33
향단  70  60  80     70.00
방자  30  50  70     60.00

In [164]:
df[["수학"]]

    수학
춘향  90
몽룡  60
향단  80
방자  70

In [168]:
df = pd.read_csv("RegularSeasonCompactResults.csv")
df

        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0         1985      20     1228      81     1328      64    N      0
1         1985      25     1106      77     1354      70    H      0
2         1985      25     1112      63     1223      56    H      0
3         1985      25     1165      70     1432      54    H      0
4         1985      25     1192      86     1447      74    H      0
...        ...     ...      ...     ...      ...     ...  ...    ...
156084    2018     132     1153      56     1222      55    N      0
156085    2018     132     1172      58     1348      57    N      0
156086    2018     132     1209      74     1426      61    N      0
156087    2018     132     1246      77     1397      72    N      0
156088    2018     132     1335      68     1217      65    N      0

[156089 rows x 8 columns]

In [172]:
df.index

RangeIndex(start=0, stop=156089, step=1)

In [174]:
print(df.head())
print(df.tail())

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0
        Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
156084    2018     132     1153      56     1222      55    N      0
156085    2018     132     1172      58     1348      57    N      0
156086    2018     132     1209      74     1426      61    N      0
156087    2018     132     1246      77     1397      72    N      0
156088    2018     132     1335      68     1217      65    N      0

## 매직 명령어
### %pwd : 현재 노트북의 디렉토리의 정보를 출력
### %ls  : 현재 디렉토리의 목록 출력
### %mkdir 디렉토리명 :  디렉토리 신규 생성
### %rmdir 디렉토리명 : 해당 디렉토리 삭제
### %load 파일명 : 해당 파일 열어 파일 내용을 코드 셀에 출력
### %%writefile 파일명 : 해당 코드 셀 전체를 파일로 저장
### %time : 한줄에 대한 실행 시간을 출력
### %%time : 코드 셀 전체에 대한 실행 시간을 출력
### %autosave 시간 : 노트북 자동 저장 시간 설정 Default => 120

In [176]:
%%writefile sample1.csv
a1, a2, a3
1, 1.11, one
2, 2.22, two
3, 3.33 ,three

Writing sample1.csv

In [182]:
# %load sample1.csv
a1, a2, a3
1, 1.11, one
2, 2.22, two
3, 3.33 ,three

In [191]:
%%time
pd.read_csv("sample1.csv")

CPU times: total: 0 ns
Wall time: 3 ms

   a1    a2     a3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [195]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33 ,three

Writing sample2.csv

In [201]:
df1 = pd.read_csv("sample2.csv", names = ["b1", "b2", "b3"])
df1

   b1    b2     b3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [203]:
pd.read_csv("sample1.csv", index_col = "a1")

      a2     a3
a1
1   1.11    one
2   2.22    two
3   3.33  three

In [205]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [211]:
pd.read_csv('sample4.txt', skiprows=[2, 3])

       데이터 포맷의 설명:
2 2.22         two
3 3.33       three

In [213]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [215]:
pd.set_option("display.max_rows", 20)  # 앞뒤로 모두 20행만 보여준다.
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [217]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [223]:
df.loc["a", "B"] = 25
df

    A   B   C   D
a  10  25  12  13
b  14  15  16  17
c  18  19  20  21

In [239]:
print(type(df.loc["a":"c"]))

<class 'pandas.core.frame.DataFrame'>

In [231]:
df.B == 15

a    False
b     True
c    False
Name: B, dtype: bool

In [235]:
df.loc[df.B > 15]

    A   B   C   D
a  10  25  12  13
c  18  19  20  21

In [237]:
df.loc["a"]

A    10
B    25
C    12
D    13
Name: a, dtype: int32

In [249]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns = ["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [253]:
df2.loc[2:3]

    A   B   C   D
2  18  19  20  21
3  22  23  24  25

In [265]:
df2.iloc[2:3]

    A   B   C   D
2  18  19  20  21

In [255]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [259]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [263]:
df.loc[df.A > 10, ["B" , "C"]]

    B   C
b  15  16
c  19  20

In [271]:
### 연습문제
df = pd.DataFrame(np.arange(0,25).reshape(5, 5),
                  # index = ["a", "b", "c", "d", "e"],
                  columns = ["A", "B", "C", "D", "E"])

In [273]:
df

    A   B   C   D   E
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [305]:
df.head(0)

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [275]:
df.loc[1:3]

    A   B   C   D   E
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [277]:
df.iloc[1:3]

    A   B   C   D   E
1   5   6   7   8   9
2  10  11  12  13  14

In [283]:
df.loc[[1,3],["C", "E"]]

    C   E
1   7   9
3  17  19

In [295]:
df.iloc[[1,3],[2, 4]]

    C   E
1   7   9
3  17  19

In [291]:
df.loc[[1,3]]

    A   B   C   D   E
1   5   6   7   8   9
3  15  16  17  18  19

In [289]:
df.iloc[[1,3]]

    A   B   C   D   E
1   5   6   7   8   9
3  15  16  17  18  19

In [317]:
np.random.seed(42)
# np.random.seed(2) 난수를 예측 가능하도록 숫자 바꾸면 다른 배열 생성
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
#np.random.randint 0에서 5사이의 정수를 가지는 4*4 배열 생성
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  3.0  4.0  2.0  4.0
1  4.0  1.0  2.0  2.0
2  2.0  4.0  3.0  NaN
3  4.0  1.0  3.0  1.0

In [319]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [321]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [323]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [325]:
planets = sns.load_dataset("planets")
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [327]:
fmri = sns.load_dataset("fmri")
fmri

     subject  timepoint event    region    signal
0        s13         18  stim  parietal -0.017552
1         s5         14  stim  parietal -0.080883
2        s12         18  stim  parietal -0.081033
3        s11         18  stim  parietal -0.046134
4        s10         18  stim  parietal -0.037970
...      ...        ...   ...       ...       ...
1059      s0          8   cue   frontal  0.018165
1060     s13          7   cue   frontal -0.029130
1061     s12          7   cue   frontal -0.004939
1062     s11          7   cue   frontal -0.025367
1063      s0          0   cue  parietal -0.006899

[1064 rows x 5 columns]

In [331]:
import numpy as np
import pandas as pd
np.random.seed()
s2 = pd.Series(np.random.randint(10, size=1000))
s2.head()

0    7
1    4
2    0
3    2
4    4
dtype: int32

In [333]:
s2.value_counts().sort_index()  ## ascending=False은 내림차순

0    103
1    108
2     92
3     90
4    101
5     91
6     85
7    113
8    107
9    110
Name: count, dtype: int64

In [335]:
# by 인수로 정렬 기준이 되는 열을 지정
df.sort_values(by=1)

     0    1    2    3
1  4.0  1.0  2.0  2.0
3  4.0  1.0  3.0  1.0
0  3.0  4.0  2.0  4.0
2  2.0  4.0  3.0  NaN

In [337]:
df.sort_values(by=[1, 2])

     0    1    2    3
1  4.0  1.0  2.0  2.0
3  4.0  1.0  3.0  1.0
0  3.0  4.0  2.0  4.0
2  2.0  4.0  3.0  NaN

In [339]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [357]:
titanic.value_counts("sex")

sex
male      577
female    314
Name: count, dtype: int64

In [391]:
# 나이(age) 열의 빈도 수 계산
t1 = titanic['age'].value_counts()
t1_index_floor = t1.index.to_series().apply(np.floor).astype(int)

t1_floor_index = pd.Series(t1.values, index = t1_index_floor)

print("원본 나이 값과 빈도수 :")
print(t1)
print("\n내림 처리된 나이 값과 빈도 수:")
print(t1_floor_index)
# # 빈도 수 올림
# t1_ceil = t1.apply(np.ceil)

# print(t1_ceil)

원본 나이 값과 빈도수 :
age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

내림 처리된 나이 값과 빈도 수:
age
24    30
22    27
18    26
19    25
28    25
      ..
36     1
55     1
0      1
23     1
74     1
Length: 88, dtype: int64

In [371]:
titanic["class"].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [373]:
titanic["alive"].value_counts()

alive
no     549
yes    342
Name: count, dtype: int64

In [403]:
ages = titanic["age"]
aver_ages = ages.mean()
print(f"{aver_ages:.2f}")

29.70

In [423]:
females = titanic[titanic["sex"] == "female"]
females_ages = females["age"]
females_aver_ages = females_ages.mean()
print(f"{females_aver_ages:.2f}")

27.92

In [431]:
females = titanic[titanic["sex"] == "female"]
females_class = females[females["class"] == "First"]
females_class_ages = females_class["age"]
females_aver_ages =females_class_ages.mean()
print(f"{females_aver_ages:.2f}")

34.61

In [433]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [435]:
df3.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [437]:
#행에 적용
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [441]:
titanic["adult/child"] = titanic.apply(lambda x : "adult" if x.age >= 20 else "child", axis = 1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [471]:
titanic["category"] = titanic.apply(lambda x : x.sex if x.age >= 20 else ("Child" if x.age < 20 else "NaN"), axis = 1)
titanic.dropna()["age"].mean().round(2)

35.62

In [481]:
age_mean = 29.7
age_std = titanic["age"].std() # 나이의 표준편차를 구함

# NAN 값을 가진 행들의 인덱스를 찾음
nan_indices = titanic["age"].isna()

# 평균 35.62와 표준편차로 정규분포에서 랜덤하게 값 생성
random_ages = np.random.normal(loc = age_mean, scale = age_std, size = nan_indices.sum())

titanic.loc[nan_indices, "age"] = random_ages

titanic.tail(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category
871,1,1,female,47.000000,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False,adult,female
872,0,1,male,33.000000,0,0,5.0000,S,First,man,True,B,Southampton,no,True,adult,male
873,0,3,male,47.000000,0,0,9.0000,S,Third,man,True,NaN,Southampton,no,True,adult,male
874,1,2,female,28.000000,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False,adult,female
875,1,3,female,15.000000,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True,child,Child
876,0,3,male,20.000000,0,0,9.8458,S,Third,man,True,NaN,Southampton,no,True,adult,male
877,0,3,male,19.000000,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,child,Child
878,0,3,male,31.545711,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,child,NaN
879,1,1,female,56.000000,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False,adult,female
880,1,2,female,25.000000,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False,adult,female
881,0,3,male,33.000000,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,adult,male
882,0,3,female,22.000000,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,adult,female
883,0,2,male,28.000000,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,adult,male
884,0,3,male,25.000000,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
885,0,3,female,39.000000,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,adult,female
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,Child
888,0,3,female,35.600162,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,NaN
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male